# RbsConduitTradesize Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsConduitTradesize Property
ParameterTypeId Class See Also
---
"Conduit Size Lookup"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsConduitTradesize { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsConduitTradesize As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsConduitTradesize {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace